In [2]:
import pandas as pd
from pandas import Series, DataFrame

In [3]:
print("pandas 버젼", pd.__version__)

pandas 버젼 0.24.2

In [46]:
## 홍길동 팀 대항 게임 5일간 점수
gildong=Series([1000,14000,3000, 3000, 1000],index=['2019-05-01','2019-05-02','2019-05-03','2019-05-04','2019-05-05'])

## 날짜를 넣어서 Series 객체 만들기

In [52]:
gildong

2019-05-01     1000
2019-05-02    14000
2019-05-03     3000
2019-05-04     3000
2019-05-05     1000
dtype: int64

In [48]:
toto=Series([90,85,95,100,75], index=[1,2,3,4,5])
toto

# '2019-05-01','2019-05-02','2019-05-03','2019-05-04','2019-05-05'

1     90
2     85
3     95
4    100
5     75
dtype: int64

In [56]:
df=pd.DataFrame({"gildong":gildong.values, "toto":toto}, index=toto.index)
df

   gildong  toto
1     1000    90
2    14000    85
3     3000    95
4     3000   100
5     1000    75

In [35]:
data={"gildong":[1000,14000,3000, 3000, 1000],
    "toto":[90,85,95,100,75] }

In [50]:
df=pd.DataFrame(data)
df

   gildong  toto
0     1000    90
1    14000    85
2     3000    95
3     3000   100
4     1000    75

In [51]:
dat=pd.DataFrame({"gildong":gildong, "toto":toto})
dat

            gildong   toto
2019-05-01   1000.0    NaN
2019-05-02  14000.0    NaN
2019-05-03   3000.0    NaN
2019-05-04   3000.0    NaN
2019-05-05   1000.0    NaN
1               NaN   90.0
2               NaN   85.0
3               NaN   95.0
4               NaN  100.0
5               NaN   75.0

In [66]:
df=pd.DataFrame({
    "toto":[1500,3000,5000,7000,5500],
"apple":[4000,5000,6000,5500,4500],
"gildong":[2000,2500,3000,4000,3000],
"catanddog":[7000,5000,3000,5000,4000]
    })

In [68]:
toto=[1500,3000,5000,7000,5500]
apple=[4000,5000,6000,5500,4500]
gildong=[2000,2500,3000,4000,3000]
catanddog=[7000,5000,3000,5000,4000]

In [71]:
df1=pd.DataFrame({"toto":toto, "apple":apple, "gildong":gildong,"catanddog":catanddog})
df1

   toto  apple  gildong  catanddog
0  1500   4000     2000       7000
1  3000   5000     2500       5000
2  5000   6000     3000       3000
3  7000   5500     4000       5000
4  5500   4500     3000       4000

In [87]:
df1["total"]=df1["toto"]+df1["apple"]+df1["gildong"]+df1["catanddog"]

df1

   toto  apple  gildong  catanddog  total
0  1500   4000     2000       7000  14500
1  3000   5000     2500       5000  15500
2  5000   6000     3000       3000  17000
3  7000   5500     4000       5000  21500
4  5500   4500     3000       4000  17000

In [92]:

df1[["toto","apple"]]

   toto  apple
0  1500   4000
1  3000   5000
2  5000   6000
3  7000   5500
4  5500   4500

In [98]:
df1.iloc[0:2,0:3]

   toto  apple  gildong
0  1500   4000     2000
1  3000   5000     2500

In [99]:
df.loc[:,['apple','catanddog']]

   apple  catanddog
0   4000       7000
1   5000       5000
2   6000       3000
3   5500       5000
4   4500       4000

In [104]:
df.loc['2':'3',:]

   toto  apple  gildong  catanddog
2  5000   6000     3000       3000
3  7000   5500     4000       5000

In [108]:
df1.drop(['total'],axis=1,inplace=True)
df1

   toto  apple  gildong  catanddog
0  1500   4000     2000       7000
1  3000   5000     2500       5000
2  5000   6000     3000       3000
3  7000   5500     4000       5000
4  5500   4500     3000       4000

In [131]:
a=df1.drop([1,2],axis=0)
a

   toto  apple  gildong  catanddog
0  1500   4000     2000       7000
3  7000   5500     4000       5000
4  5500   4500     3000       4000

In [88]:
import numpy as np

In [ ]:
np.sum(df[0:])

In [134]:
df1["total"]=df1["toto"]+df1["apple"]+df1["gildong"]+df1["catanddog"]

df1.sort_values(by='total')
#df1.sort_values(by='total', ascending=False)

   toto  apple  gildong  catanddog  total
0  1500   4000     2000       7000  14500
1  3000   5000     2500       5000  15500
2  5000   6000     3000       3000  17000
4  5500   4500     3000       4000  17000
3  7000   5500     4000       5000  21500

In [139]:
df1.sum()

toto         22000
apple        25000
gildong      14500
catanddog    24000
total        85500
dtype: int64

In [143]:
df1.loc["rowsum"]=df1.sum().values
df1

           toto    apple  gildong  catanddog    total
0        1500.0   4000.0   2000.0     7000.0  14500.0
1        3000.0   5000.0   2500.0     5000.0  15500.0
2        5000.0   6000.0   3000.0     3000.0  17000.0
3        7000.0   5500.0   4000.0     5000.0  21500.0
4        5500.0   4500.0   3000.0     4000.0  17000.0
rowsum  22000.0  25000.0  14500.0    24000.0  85500.0